irrelated_knob_test/sysbench_run_1713077612.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 30
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 30 tps: 18.95 qps: 890.88 (r/w/o: 684.37/138.67/67.84) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 30 tps: 73.03 qps: 1384.62 (r/w/o: 989.44/249.11/146.07) lat (ms,95%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 30 tps: 24.00 qps: 348.01 (r/w/o: 204.01/96.00/48.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 30 tps: 9.00 qps: 404.00 (r/w/o: 288.00/98.00/18.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 30 tps: 36.00 qps: 539.00 (r/w/o: 364.00/103.00/72.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 30 tps: 18.00 qps: 400.00 (r/w/o: 318.00/46.00/36.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 30 tps: 13.00 qps: 219.99 (r/w/o: 127.00/67.00/26.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 30 tps: 14.00 qps: 373.01 (r/w/o: 314.01/31.00/28.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 30 tps: 15.00 qps: 153.00 (r/w/o: 57.00/66.00/30.00) lat (ms,95%): 3326.55 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 30 tps: 13.00 qps: 312.99 (r/w/o: 232.99/54.00/26.00) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 30 tps: 22.00 qps: 392.01 (r/w/o: 256.01/92.00/44.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 30 tps: 10.00 qps: 344.99 (r/w/o: 298.99/26.00/20.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 30 tps: 0.00 qps: 9.00 (r/w/o: 9.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 30 tps: 29.00 qps: 449.00 (r/w/o: 266.00/125.00/58.00) lat (ms,95%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 30 tps: 13.00 qps: 309.00 (r/w/o: 233.00/50.00/26.00) lat (ms,95%): 1401.61 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 30 tps: 15.00 qps: 287.01 (r/w/o: 145.00/112.00/30.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 30 tps: 19.00 qps: 392.00 (r/w/o: 330.00/24.00/38.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 30 tps: 21.00 qps: 447.99 (r/w/o: 321.99/84.00/42.00) lat (ms,95%): 1401.61 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 30 tps: 0.00 qps: 62.00 (r/w/o: 62.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 30 tps: 38.00 qps: 427.02 (r/w/o: 209.01/142.01/76.00) lat (ms,95%): 3841.98 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 30 tps: 9.00 qps: 416.00 (r/w/o: 358.00/40.00/18.00) lat (ms,95%): 1109.09 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 30 tps: 24.00 qps: 516.00 (r/w/o: 361.00/107.00/48.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 30 tps: 0.00 qps: 66.00 (r/w/o: 66.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 30 tps: 41.00 qps: 693.98 (r/w/o: 462.99/149.00/82.00) lat (ms,95%): 3773.42 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 30 tps: 11.00 qps: 347.01 (r/w/o: 265.01/60.00/22.00) lat (ms,95%): 1170.65 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 30 tps: 49.00 qps: 904.97 (r/w/o: 626.98/179.99/98.00) lat (ms,95%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 30 tps: 11.00 qps: 242.01 (r/w/o: 107.00/113.00/22.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 30 tps: 33.00 qps: 678.00 (r/w/o: 502.00/110.00/66.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 30 tps: 21.00 qps: 323.99 (r/w/o: 228.99/53.00/42.00) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 30 tps: 0.00 qps: 131.00 (r/w/o: 131.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 30 tps: 61.00 qps: 1071.03 (r/w/o: 721.02/228.01/122.00) lat (ms,95%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 30 tps: 25.00 qps: 516.00 (r/w/o: 356.00/110.00/50.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 30 tps: 30.00 qps: 741.00 (r/w/o: 534.00/147.00/60.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 30 tps: 30.00 qps: 378.99 (r/w/o: 201.99/117.00/60.00) lat (ms,95%): 943.16 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 30 tps: 30.00 qps: 622.00 (r/w/o: 447.00/115.00/60.00) lat (ms,95%): 1213.57 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 30 tps: 19.00 qps: 495.01 (r/w/o: 406.01/51.00/38.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 30 tps: 12.00 qps: 184.00 (r/w/o: 87.00/73.00/24.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 30 tps: 3.00 qps: 193.00 (r/w/o: 187.00/0.00/6.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 30 tps: 39.00 qps: 672.00 (r/w/o: 453.00/141.00/78.00) lat (ms,95%): 3326.55 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 30 tps: 28.00 qps: 576.00 (r/w/o: 403.00/117.00/56.00) lat (ms,95%): 861.95 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 30 tps: 0.00 qps: 82.00 (r/w/o: 82.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 30 tps: 31.00 qps: 700.98 (r/w/o: 419.99/218.99/62.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 30 tps: 26.00 qps: 300.01 (r/w/o: 239.01/9.00/52.00) lat (ms,95%): 960.30 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 30 tps: 14.00 qps: 401.00 (r/w/o: 261.00/112.00/28.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 30 tps: 24.00 qps: 580.98 (r/w/o: 400.99/132.00/48.00) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 30 tps: 26.00 qps: 290.00 (r/w/o: 221.00/17.00/52.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 30 tps: 7.00 qps: 300.00 (r/w/o: 235.00/51.00/14.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 30 tps: 29.00 qps: 456.00 (r/w/o: 304.00/94.00/58.00) lat (ms,95%): 2449.36 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 30 tps: 20.00 qps: 424.00 (r/w/o: 296.00/88.00/40.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 30 tps: 23.00 qps: 422.00 (r/w/o: 286.00/90.00/46.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 30 tps: 36.00 qps: 684.02 (r/w/o: 477.02/135.00/72.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 30 tps: 23.00 qps: 532.00 (r/w/o: 369.00/117.00/46.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 30 tps: 26.00 qps: 467.00 (r/w/o: 331.00/84.00/52.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 30 tps: 21.00 qps: 452.99 (r/w/o: 332.99/78.00/42.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 30 tps: 14.00 qps: 365.00 (r/w/o: 273.00/64.00/28.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 30 tps: 0.00 qps: 34.00 (r/w/o: 34.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 30 tps: 30.00 qps: 497.01 (r/w/o: 334.01/103.00/60.00) lat (ms,95%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 30 tps: 0.00 qps: 86.00 (r/w/o: 86.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 30 tps: 33.00 qps: 627.01 (r/w/o: 389.00/172.00/66.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 30 tps: 32.00 qps: 616.00 (r/w/o: 436.00/116.00/64.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 30 tps: 14.00 qps: 260.00 (r/w/o: 171.00/61.00/28.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 30 tps: 28.00 qps: 482.00 (r/w/o: 326.00/100.00/56.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 30 tps: 19.00 qps: 437.01 (r/w/o: 331.01/68.00/38.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 30 tps: 20.00 qps: 349.00 (r/w/o: 214.00/95.00/40.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 30 tps: 25.00 qps: 550.00 (r/w/o: 394.00/106.00/50.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 30 tps: 17.00 qps: 312.99 (r/w/o: 234.99/44.00/34.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 30 tps: 18.00 qps: 384.01 (r/w/o: 254.01/94.00/36.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 30 tps: 29.00 qps: 569.98 (r/w/o: 412.99/99.00/58.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 30 tps: 28.00 qps: 465.01 (r/w/o: 290.01/119.00/56.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 30 tps: 16.00 qps: 465.99 (r/w/o: 360.99/73.00/32.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 30 tps: 24.00 qps: 404.01 (r/w/o: 282.01/74.00/48.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 30 tps: 14.00 qps: 380.99 (r/w/o: 257.99/95.00/28.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 30 tps: 21.00 qps: 460.00 (r/w/o: 346.00/72.00/42.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 30 tps: 29.00 qps: 492.00 (r/w/o: 329.00/105.00/58.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 30 tps: 15.00 qps: 318.01 (r/w/o: 241.01/47.00/30.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 30 tps: 30.00 qps: 462.00 (r/w/o: 290.00/112.00/60.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 30 tps: 16.00 qps: 424.99 (r/w/o: 287.99/105.00/32.00) lat (ms,95%): 1401.61 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 30 tps: 19.00 qps: 456.01 (r/w/o: 345.01/73.00/38.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 30 tps: 35.00 qps: 600.00 (r/w/o: 410.00/120.00/70.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 30 tps: 10.00 qps: 232.00 (r/w/o: 166.00/46.00/20.00) lat (ms,95%): 2449.36 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 30 tps: 28.00 qps: 505.99 (r/w/o: 353.99/96.00/56.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 30 tps: 27.00 qps: 559.00 (r/w/o: 401.00/104.00/54.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 30 tps: 16.00 qps: 276.00 (r/w/o: 157.00/87.00/32.00) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 30 tps: 18.00 qps: 507.01 (r/w/o: 410.01/61.00/36.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 30 tps: 27.00 qps: 415.00 (r/w/o: 253.00/108.00/54.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 30 tps: 23.00 qps: 500.99 (r/w/o: 359.99/95.00/46.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 30 tps: 22.00 qps: 405.00 (r/w/o: 279.00/82.00/44.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 30 tps: 22.00 qps: 491.01 (r/w/o: 352.01/95.00/44.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 30 tps: 9.00 qps: 321.00 (r/w/o: 241.00/62.00/18.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 30 tps: 37.00 qps: 629.98 (r/w/o: 426.99/129.00/74.00) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 30 tps: 23.00 qps: 417.00 (r/w/o: 288.00/83.00/46.00) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 30 tps: 23.00 qps: 506.01 (r/w/o: 359.01/101.00/46.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 30 tps: 29.00 qps: 424.00 (r/w/o: 276.00/90.00/58.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 30 tps: 28.00 qps: 616.00 (r/w/o: 427.00/133.00/56.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 30 tps: 11.00 qps: 376.00 (r/w/o: 294.00/60.00/22.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 30 tps: 29.00 qps: 502.00 (r/w/o: 348.00/96.00/58.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 30 tps: 23.00 qps: 480.00 (r/w/o: 332.00/102.00/46.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 30 tps: 28.00 qps: 502.00 (r/w/o: 351.00/95.00/56.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 30 tps: 28.00 qps: 527.99 (r/w/o: 350.99/121.00/56.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 30 tps: 25.00 qps: 510.00 (r/w/o: 351.00/109.00/50.00) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 30 tps: 23.00 qps: 528.00 (r/w/o: 399.00/83.00/46.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 30 tps: 26.00 qps: 488.02 (r/w/o: 332.01/104.00/52.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 30 tps: 19.00 qps: 458.00 (r/w/o: 328.00/92.00/38.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 30 tps: 23.00 qps: 427.00 (r/w/o: 308.00/73.00/46.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 30 tps: 28.00 qps: 489.00 (r/w/o: 326.00/107.00/56.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 30 tps: 24.00 qps: 512.01 (r/w/o: 350.00/114.00/48.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 30 tps: 21.00 qps: 439.00 (r/w/o: 317.00/80.00/42.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 30 tps: 32.00 qps: 553.98 (r/w/o: 383.99/106.00/64.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 30 tps: 17.00 qps: 488.01 (r/w/o: 345.01/109.00/34.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 30 tps: 25.00 qps: 452.99 (r/w/o: 322.99/80.00/50.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 30 tps: 24.00 qps: 519.01 (r/w/o: 361.01/110.00/48.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 30 tps: 36.00 qps: 700.01 (r/w/o: 493.01/135.00/72.00) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 30 tps: 26.00 qps: 464.00 (r/w/o: 320.00/92.00/52.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 30 tps: 26.00 qps: 588.00 (r/w/o: 437.00/99.00/52.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 30 tps: 3.00 qps: 97.00 (r/w/o: 91.00/0.00/6.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 122s ] thds: 30 tps: 22.00 qps: 434.98 (r/w/o: 307.99/83.00/44.00) lat (ms,95%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 30 tps: 34.00 qps: 441.03 (r/w/o: 237.01/136.01/68.00) lat (ms,95%): 4855.31 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 30 tps: 10.00 qps: 452.00 (r/w/o: 318.00/114.00/20.00) lat (ms,95%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 30 tps: 21.00 qps: 418.00 (r/w/o: 351.00/25.00/42.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 30 tps: 24.00 qps: 184.00 (r/w/o: 44.00/92.00/48.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 127s ] thds: 30 tps: 7.00 qps: 254.99 (r/w/o: 221.99/19.00/14.00) lat (ms,95%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 128s ] thds: 30 tps: 2.00 qps: 151.00 (r/w/o: 133.00/14.00/4.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 129s ] thds: 30 tps: 24.00 qps: 494.99 (r/w/o: 301.99/145.00/48.00) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 30 tps: 34.00 qps: 706.02 (r/w/o: 515.02/123.00/68.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 131s ] thds: 30 tps: 25.00 qps: 388.00 (r/w/o: 262.00/76.00/50.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 30 tps: 7.00 qps: 277.00 (r/w/o: 248.00/15.00/14.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 133s ] thds: 30 tps: 25.00 qps: 497.99 (r/w/o: 349.99/98.00/50.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 134s ] thds: 30 tps: 32.00 qps: 519.02 (r/w/o: 321.01/134.00/64.00) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 30 tps: 24.00 qps: 474.95 (r/w/o: 316.97/109.99/48.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 136s ] thds: 30 tps: 29.00 qps: 619.06 (r/w/o: 429.04/132.01/58.01) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 137s ] thds: 30 tps: 32.00 qps: 471.99 (r/w/o: 293.99/114.00/64.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 138s ] thds: 30 tps: 14.00 qps: 530.00 (r/w/o: 422.00/80.00/28.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 139s ] thds: 30 tps: 22.00 qps: 432.99 (r/w/o: 348.00/41.00/44.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 30 tps: 0.00 qps: 14.00 (r/w/o: 11.00/3.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 141s ] thds: 30 tps: 31.00 qps: 301.01 (r/w/o: 122.00/117.00/62.00) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 142s ] thds: 30 tps: 8.00 qps: 538.00 (r/w/o: 409.00/113.00/16.00) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 143s ] thds: 30 tps: 17.00 qps: 304.00 (r/w/o: 253.00/17.00/34.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 144s ] thds: 30 tps: 15.00 qps: 390.00 (r/w/o: 210.00/150.00/30.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 30 tps: 30.00 qps: 283.99 (r/w/o: 223.99/0.00/60.00) lat (ms,95%): 3639.94 err/s: 0.00 reconn/s: 0.00
[ 146s ] thds: 30 tps: 32.00 qps: 668.02 (r/w/o: 476.02/128.00/64.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 147s ] thds: 30 tps: 19.00 qps: 534.00 (r/w/o: 417.00/79.00/38.00) lat (ms,95%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 148s ] thds: 30 tps: 0.00 qps: 17.00 (r/w/o: 17.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 149s ] thds: 30 tps: 31.00 qps: 529.99 (r/w/o: 338.99/129.00/62.00) lat (ms,95%): 2632.28 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 30 tps: 38.00 qps: 674.02 (r/w/o: 443.01/155.01/76.00) lat (ms,95%): 943.16 err/s: 0.00 reconn/s: 0.00
[ 151s ] thds: 30 tps: 32.00 qps: 621.00 (r/w/o: 431.00/126.00/64.00) lat (ms,95%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 152s ] thds: 30 tps: 12.00 qps: 376.98 (r/w/o: 279.99/73.00/24.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 153s ] thds: 30 tps: 19.00 qps: 441.01 (r/w/o: 355.01/48.00/38.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 154s ] thds: 30 tps: 34.00 qps: 268.00 (r/w/o: 70.00/130.00/68.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 30 tps: 19.00 qps: 676.01 (r/w/o: 515.00/123.00/38.00) lat (ms,95%): 995.51 err/s: 0.00 reconn/s: 0.00
[ 156s ] thds: 30 tps: 29.00 qps: 525.00 (r/w/o: 367.00/100.00/58.00) lat (ms,95%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 157s ] thds: 30 tps: 35.00 qps: 758.99 (r/w/o: 561.99/127.00/70.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 158s ] thds: 30 tps: 23.00 qps: 491.01 (r/w/o: 368.01/77.00/46.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 159s ] thds: 30 tps: 30.00 qps: 636.98 (r/w/o: 425.99/151.00/60.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 30 tps: 46.00 qps: 836.02 (r/w/o: 582.02/162.00/92.00) lat (ms,95%): 1170.65 err/s: 0.00 reconn/s: 0.00
[ 161s ] thds: 30 tps: 22.00 qps: 625.00 (r/w/o: 411.00/170.00/44.00) lat (ms,95%): 1170.65 err/s: 0.00 reconn/s: 0.00
[ 162s ] thds: 30 tps: 35.00 qps: 573.00 (r/w/o: 420.00/83.00/70.00) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 163s ] thds: 30 tps: 7.00 qps: 224.99 (r/w/o: 199.00/12.00/14.00) lat (ms,95%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 164s ] thds: 30 tps: 42.00 qps: 660.02 (r/w/o: 415.01/161.00/84.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 30 tps: 28.00 qps: 545.00 (r/w/o: 370.00/119.00/56.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 166s ] thds: 30 tps: 27.00 qps: 648.00 (r/w/o: 470.00/124.00/54.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 167s ] thds: 30 tps: 37.00 qps: 714.93 (r/w/o: 528.95/111.99/73.99) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 168s ] thds: 30 tps: 0.00 qps: 92.01 (r/w/o: 92.01/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 169s ] thds: 30 tps: 42.00 qps: 549.98 (r/w/o: 298.99/166.99/84.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 30 tps: 10.00 qps: 433.00 (r/w/o: 331.00/82.00/20.00) lat (ms,95%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 171s ] thds: 30 tps: 37.00 qps: 694.02 (r/w/o: 498.02/122.00/74.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 172s ] thds: 30 tps: 34.00 qps: 550.00 (r/w/o: 360.00/122.00/68.00) lat (ms,95%): 1170.65 err/s: 0.00 reconn/s: 0.00
[ 173s ] thds: 30 tps: 0.00 qps: 234.00 (r/w/o: 234.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 174s ] thds: 30 tps: 16.00 qps: 387.99 (r/w/o: 223.99/132.00/32.00) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 30 tps: 30.00 qps: 484.01 (r/w/o: 363.01/61.00/60.00) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 176s ] thds: 30 tps: 39.00 qps: 676.98 (r/w/o: 445.99/153.00/78.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 177s ] thds: 30 tps: 29.00 qps: 582.02 (r/w/o: 403.01/121.00/58.00) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 178s ] thds: 30 tps: 17.00 qps: 353.00 (r/w/o: 249.00/70.00/34.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 179s ] thds: 30 tps: 27.00 qps: 522.00 (r/w/o: 360.00/108.00/54.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 30 tps: 31.00 qps: 670.98 (r/w/o: 485.99/123.00/62.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 181s ] thds: 30 tps: 1.00 qps: 241.01 (r/w/o: 129.00/110.00/2.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 182s ] thds: 30 tps: 38.00 qps: 599.00 (r/w/o: 449.00/74.00/76.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 183s ] thds: 30 tps: 25.00 qps: 541.00 (r/w/o: 433.00/58.00/50.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 184s ] thds: 30 tps: 29.00 qps: 580.00 (r/w/o: 406.00/116.00/58.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 30 tps: 30.00 qps: 223.99 (r/w/o: 44.00/120.00/60.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 186s ] thds: 30 tps: 11.00 qps: 517.01 (r/w/o: 421.01/74.00/22.00) lat (ms,95%): 1191.92 err/s: 0.00 reconn/s: 0.00
[ 187s ] thds: 30 tps: 31.00 qps: 717.00 (r/w/o: 510.00/145.00/62.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 188s ] thds: 30 tps: 17.00 qps: 244.00 (r/w/o: 170.00/40.00/34.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 189s ] thds: 30 tps: 26.00 qps: 482.99 (r/w/o: 333.99/97.00/52.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 30 tps: 19.00 qps: 473.01 (r/w/o: 368.01/67.00/38.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 191s ] thds: 30 tps: 36.00 qps: 693.98 (r/w/o: 466.98/154.99/72.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 192s ] thds: 30 tps: 28.00 qps: 464.02 (r/w/o: 301.01/107.00/56.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 193s ] thds: 30 tps: 12.00 qps: 305.00 (r/w/o: 220.00/61.00/24.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 194s ] thds: 30 tps: 49.00 qps: 756.98 (r/w/o: 483.98/174.99/98.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 30 tps: 5.00 qps: 402.01 (r/w/o: 377.01/15.00/10.00) lat (ms,95%): 943.16 err/s: 0.00 reconn/s: 0.00
[ 196s ] thds: 30 tps: 18.00 qps: 355.00 (r/w/o: 178.00/141.00/36.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 197s ] thds: 30 tps: 34.00 qps: 656.00 (r/w/o: 460.00/128.00/68.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 198s ] thds: 30 tps: 27.00 qps: 494.99 (r/w/o: 383.99/57.00/54.00) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 199s ] thds: 30 tps: 35.00 qps: 691.02 (r/w/o: 449.01/172.00/70.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 30 tps: 34.00 qps: 668.98 (r/w/o: 477.99/123.00/68.00) lat (ms,95%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 201s ] thds: 30 tps: 8.00 qps: 265.01 (r/w/o: 235.01/14.00/16.00) lat (ms,95%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 202s ] thds: 30 tps: 43.00 qps: 636.00 (r/w/o: 381.00/169.00/86.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 203s ] thds: 30 tps: 5.00 qps: 292.00 (r/w/o: 243.00/39.00/10.00) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 204s ] thds: 30 tps: 36.00 qps: 617.00 (r/w/o: 398.00/147.00/72.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 30 tps: 36.00 qps: 724.00 (r/w/o: 504.00/148.00/72.00) lat (ms,95%): 1149.76 err/s: 0.00 reconn/s: 0.00
[ 206s ] thds: 30 tps: 16.00 qps: 447.00 (r/w/o: 378.00/37.00/32.00) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 207s ] thds: 30 tps: 27.00 qps: 466.00 (r/w/o: 249.00/163.00/54.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 208s ] thds: 30 tps: 33.00 qps: 633.00 (r/w/o: 486.00/81.00/66.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 209s ] thds: 30 tps: 25.00 qps: 453.00 (r/w/o: 296.00/107.00/50.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 30 tps: 24.00 qps: 596.98 (r/w/o: 424.98/124.00/48.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 211s ] thds: 30 tps: 24.00 qps: 480.02 (r/w/o: 338.01/94.00/48.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 212s ] thds: 30 tps: 37.00 qps: 736.00 (r/w/o: 548.00/114.00/74.00) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 213s ] thds: 30 tps: 17.00 qps: 370.99 (r/w/o: 275.99/61.00/34.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 214s ] thds: 30 tps: 38.00 qps: 627.02 (r/w/o: 375.01/176.00/76.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 30 tps: 28.00 qps: 607.00 (r/w/o: 445.00/106.00/56.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 216s ] thds: 30 tps: 33.00 qps: 526.00 (r/w/o: 327.00/133.00/66.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 217s ] thds: 30 tps: 23.00 qps: 531.99 (r/w/o: 402.99/83.00/46.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 218s ] thds: 30 tps: 26.00 qps: 646.03 (r/w/o: 490.03/104.01/52.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 219s ] thds: 30 tps: 34.00 qps: 574.98 (r/w/o: 383.99/123.00/68.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 30 tps: 28.00 qps: 452.01 (r/w/o: 264.00/132.00/56.00) lat (ms,95%): 1050.76 err/s: 0.00 reconn/s: 0.00
[ 221s ] thds: 30 tps: 10.00 qps: 365.00 (r/w/o: 304.00/41.00/20.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 222s ] thds: 30 tps: 32.00 qps: 746.01 (r/w/o: 505.00/177.00/64.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 223s ] thds: 30 tps: 21.00 qps: 250.99 (r/w/o: 185.99/23.00/42.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 224s ] thds: 30 tps: 29.00 qps: 649.02 (r/w/o: 480.01/111.00/58.00) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 30 tps: 35.00 qps: 561.00 (r/w/o: 343.00/148.00/70.00) lat (ms,95%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 226s ] thds: 30 tps: 25.00 qps: 518.00 (r/w/o: 355.00/113.00/50.00) lat (ms,95%): 995.51 err/s: 0.00 reconn/s: 0.00
[ 227s ] thds: 30 tps: 22.00 qps: 585.00 (r/w/o: 430.00/111.00/44.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 228s ] thds: 30 tps: 32.00 qps: 579.99 (r/w/o: 403.99/112.00/64.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 229s ] thds: 30 tps: 20.00 qps: 453.00 (r/w/o: 351.00/62.00/40.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 30 tps: 25.00 qps: 378.01 (r/w/o: 224.01/104.00/50.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 231s ] thds: 30 tps: 23.00 qps: 457.00 (r/w/o: 323.00/88.00/46.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 232s ] thds: 30 tps: 20.00 qps: 498.99 (r/w/o: 360.99/98.00/40.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 233s ] thds: 30 tps: 28.00 qps: 602.99 (r/w/o: 417.00/130.00/56.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 234s ] thds: 30 tps: 25.00 qps: 550.00 (r/w/o: 391.00/109.00/50.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 30 tps: 37.00 qps: 611.02 (r/w/o: 426.02/111.00/74.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 236s ] thds: 30 tps: 21.00 qps: 501.98 (r/w/o: 364.99/95.00/42.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 237s ] thds: 30 tps: 28.00 qps: 549.02 (r/w/o: 379.01/114.00/56.00) lat (ms,95%): 1401.61 err/s: 0.00 reconn/s: 0.00
[ 238s ] thds: 30 tps: 16.00 qps: 366.00 (r/w/o: 294.00/40.00/32.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 239s ] thds: 30 tps: 25.00 qps: 385.99 (r/w/o: 224.99/111.00/50.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 30 tps: 17.00 qps: 387.01 (r/w/o: 282.01/71.00/34.00) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 241s ] thds: 30 tps: 15.00 qps: 362.00 (r/w/o: 291.00/41.00/30.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 242s ] thds: 30 tps: 27.00 qps: 393.00 (r/w/o: 223.00/116.00/54.00) lat (ms,95%): 2932.60 err/s: 0.00 reconn/s: 0.00
[ 243s ] thds: 30 tps: 33.00 qps: 530.00 (r/w/o: 338.00/126.00/66.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 244s ] thds: 30 tps: 2.00 qps: 341.00 (r/w/o: 307.00/30.00/4.00) lat (ms,95%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 30 tps: 28.00 qps: 494.99 (r/w/o: 311.99/127.00/56.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 246s ] thds: 30 tps: 6.00 qps: 178.00 (r/w/o: 164.00/2.00/12.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 247s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 248s ] thds: 30 tps: 39.00 qps: 430.01 (r/w/o: 219.01/133.00/78.00) lat (ms,95%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 249s ] thds: 30 tps: 24.00 qps: 793.00 (r/w/o: 616.00/129.00/48.00) lat (ms,95%): 1170.65 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 30 tps: 33.00 qps: 437.00 (r/w/o: 265.00/106.00/66.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 251s ] thds: 30 tps: 0.00 qps: 209.00 (r/w/o: 189.00/20.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 252s ] thds: 30 tps: 24.00 qps: 351.99 (r/w/o: 209.99/94.00/48.00) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 253s ] thds: 30 tps: 16.00 qps: 487.01 (r/w/o: 360.01/95.00/32.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 254s ] thds: 30 tps: 27.00 qps: 498.00 (r/w/o: 386.00/58.00/54.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 30 tps: 29.00 qps: 611.99 (r/w/o: 442.99/111.00/58.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 256s ] thds: 30 tps: 39.00 qps: 536.00 (r/w/o: 303.00/155.00/78.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 257s ] thds: 30 tps: 12.00 qps: 442.01 (r/w/o: 343.01/75.00/24.00) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 258s ] thds: 30 tps: 40.00 qps: 754.00 (r/w/o: 515.00/159.00/80.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 259s ] thds: 30 tps: 34.00 qps: 501.00 (r/w/o: 322.00/111.00/68.00) lat (ms,95%): 1032.01 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 30 tps: 7.00 qps: 417.99 (r/w/o: 364.99/39.00/14.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 261s ] thds: 30 tps: 8.00 qps: 268.01 (r/w/o: 112.00/140.00/16.00) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 262s ] thds: 30 tps: 59.00 qps: 824.00 (r/w/o: 581.00/125.00/118.00) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 263s ] thds: 30 tps: 28.00 qps: 660.93 (r/w/o: 489.95/114.99/55.99) lat (ms,95%): 1089.30 err/s: 0.00 reconn/s: 0.00
[ 264s ] thds: 30 tps: 25.00 qps: 533.06 (r/w/o: 382.04/101.01/50.01) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 30 tps: 15.00 qps: 521.00 (r/w/o: 325.00/166.00/30.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 266s ] thds: 30 tps: 35.00 qps: 589.00 (r/w/o: 490.00/29.00/70.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 267s ] thds: 30 tps: 51.00 qps: 628.01 (r/w/o: 327.00/199.00/102.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 268s ] thds: 30 tps: 19.00 qps: 779.98 (r/w/o: 608.98/133.00/38.00) lat (ms,95%): 1032.01 err/s: 0.00 reconn/s: 0.00
[ 269s ] thds: 30 tps: 37.00 qps: 723.01 (r/w/o: 514.01/135.00/74.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 30 tps: 19.00 qps: 251.00 (r/w/o: 163.00/50.00/38.00) lat (ms,95%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 271s ] thds: 30 tps: 29.00 qps: 375.00 (r/w/o: 214.00/103.00/58.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 272s ] thds: 30 tps: 4.00 qps: 414.98 (r/w/o: 398.99/8.00/8.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 273s ] thds: 30 tps: 58.00 qps: 1026.05 (r/w/o: 634.03/276.01/116.01) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 274s ] thds: 30 tps: 33.00 qps: 643.00 (r/w/o: 472.00/105.00/66.00) lat (ms,95%): 926.33 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 30 tps: 31.00 qps: 582.99 (r/w/o: 401.00/120.00/62.00) lat (ms,95%): 1401.61 err/s: 0.00 reconn/s: 0.00
[ 276s ] thds: 30 tps: 31.00 qps: 712.01 (r/w/o: 539.01/111.00/62.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 277s ] thds: 30 tps: 33.00 qps: 574.99 (r/w/o: 340.99/168.00/66.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 278s ] thds: 30 tps: 30.00 qps: 545.00 (r/w/o: 393.00/92.00/60.00) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 279s ] thds: 30 tps: 27.00 qps: 657.02 (r/w/o: 478.02/125.00/54.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 30 tps: 33.00 qps: 489.99 (r/w/o: 310.99/113.00/66.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 281s ] thds: 30 tps: 25.00 qps: 634.02 (r/w/o: 482.01/102.00/50.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 282s ] thds: 30 tps: 23.00 qps: 581.00 (r/w/o: 423.00/112.00/46.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 283s ] thds: 30 tps: 2.00 qps: 94.00 (r/w/o: 90.00/0.00/4.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 284s ] thds: 30 tps: 49.00 qps: 681.99 (r/w/o: 401.99/182.00/98.00) lat (ms,95%): 2632.28 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 30 tps: 12.00 qps: 495.01 (r/w/o: 365.01/106.00/24.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 286s ] thds: 30 tps: 33.00 qps: 616.00 (r/w/o: 446.00/104.00/66.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 287s ] thds: 30 tps: 29.00 qps: 456.98 (r/w/o: 309.99/89.00/58.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 288s ] thds: 30 tps: 29.00 qps: 638.02 (r/w/o: 455.01/125.00/58.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 289s ] thds: 30 tps: 22.00 qps: 462.00 (r/w/o: 343.00/75.00/44.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 30 tps: 1.00 qps: 202.00 (r/w/o: 129.00/71.00/2.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 291s ] thds: 30 tps: 52.00 qps: 928.00 (r/w/o: 647.00/177.00/104.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 292s ] thds: 30 tps: 44.00 qps: 892.97 (r/w/o: 617.98/186.99/88.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 293s ] thds: 30 tps: 17.00 qps: 311.01 (r/w/o: 243.01/34.00/34.00) lat (ms,95%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 294s ] thds: 30 tps: 37.00 qps: 659.00 (r/w/o: 444.00/141.00/74.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 30 tps: 4.00 qps: 226.99 (r/w/o: 203.99/15.00/8.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 296s ] thds: 30 tps: 30.00 qps: 567.02 (r/w/o: 397.01/110.00/60.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 297s ] thds: 30 tps: 31.00 qps: 675.00 (r/w/o: 456.00/157.00/62.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 298s ] thds: 30 tps: 37.00 qps: 708.00 (r/w/o: 457.00/177.00/74.00) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 299s ] thds: 30 tps: 25.00 qps: 386.99 (r/w/o: 280.99/56.00/50.00) lat (ms,95%): 1191.92 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 30 tps: 34.00 qps: 606.02 (r/w/o: 418.01/120.00/68.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            99246
        write:                           28356
        other:                           14178
        total:                           141780
    transactions:                        7089   (23.60 per sec.)
    queries:                             141780 (471.92 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      23.5962
    time elapsed:                        300.4294s
    total number of events:              7089

Latency (ms):
         min:                                   32.68
         avg:                                 1270.97
         max:                                 5012.67
         95th percentile:                     2493.86
         sum:                              9009940.44

Threads fairness:
    events (avg/stddev):           236.3000/5.61
    execution time (avg/stddev):   300.3313/0.05